# 常用：排序

In [1]:
sample = pd.DataFrame({
    'name': ['Bob', 'Lindy', 'Mark', 'Miki', 'Sully', 'Rose'],
    'score': [98, 78, 87, 77, 77, np.nan],
    'group': [1, 1, 1, 2, 1, 2],
})
sample

    name  score  group
0    Bob   98.0      1
1  Lindy   78.0      1
2   Mark   87.0      1
3   Miki   77.0      2
4  Sully   77.0      1
5   Rose    NaN      2

In [3]:
# 根据分数降序排序
sample.sort_values(by='score',ascending=False,na_position='last')

    name  score  group
0    Bob   98.0      1
2   Mark   87.0      1
1  Lindy   78.0      1
3   Miki   77.0      2
4  Sully   77.0      1
5   Rose    NaN      2

### 可以传入一个列表，指定排序的顺序

In [7]:
sample.sort_values(by=['group','score'])

    name  score  group
4  Sully   77.0      1
1  Lindy   78.0      1
2   Mark   87.0      1
0    Bob   98.0      1
3   Miki   77.0      2
5   Rose    NaN      2